Autodesk.Revit.DB.Structure.AnalyticalMember.Split(System.Double)
Splits the analytical member at a point on its defining curve.
Remarks:
Analytical members that are not a line or an arc are not permitted.
See Autodesk.Revit.DB.Structure.AnalyticalMember.CanSplit to determine if the analytical member is allowed to be split by this method.
parameter:
The normalized parameter value along the element (should be greater than 0 and less than 1).
Returns:
The newly created analytical member id.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Analytical member cannot be split.
Since:
2024.1

Autodesk.Revit.DB.Structure.AnalyticalMember.CanSplit
Identifies whether a particular analytical member can be split at a point on it's defining curve (by Autodesk.Revit.DB.Structure.AnalyticalMember.Split(System.Double) ).
Returns:
True if the analytical member can be split, otherwise false.
Since:
2024.1